## 9-1　カテゴリ型への変換

In [1]:
import numpy as np
import pandas as pd

#### bool 型

In [2]:
customer_tb = pd.read_csv('customer.csv')
print(customer_tb.shape)
customer_tb.head()

(1000, 5)

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [3]:
customer_tb[['sex_is_man']] = (customer_tb[['sex']] == 'man').astype('bool')
customer_tb.head()

  customer_id  age    sex  home_latitude  home_longitude  sex_is_man
0         c_1   41    man      35.092193      136.512347        True
1         c_2   38    man      35.325076      139.410551        True
2         c_3   49  woman      35.120543      136.511179       False
3         c_4   43    man      43.034868      141.240314        True
4         c_5   31    man      35.102661      136.523797        True

#### category 型

`pd.Categories`

In [4]:
customer_tb = pd.read_csv('customer.csv')
print(customer_tb.shape)
customer_tb.head()

(1000, 5)

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [5]:
customer_tb['sex_c'] = pd.Categorical(customer_tb['sex'], categories=['man', 'woman'])
customer_tb.head()

  customer_id  age    sex  home_latitude  home_longitude  sex_c
0         c_1   41    man      35.092193      136.512347    man
1         c_2   38    man      35.325076      139.410551    man
2         c_3   49  woman      35.120543      136.511179  woman
3         c_4   43    man      43.034868      141.240314    man
4         c_5   31    man      35.102661      136.523797    man

`astype`

In [6]:
customer_tb = pd.read_csv('customer.csv')
print(customer_tb.shape)
customer_tb.head()

(1000, 5)

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [7]:
customer_tb['sex_c'] = customer_tb['sex'].astype('category')
customer_tb.head()

  customer_id  age    sex  home_latitude  home_longitude  sex_c
0         c_1   41    man      35.092193      136.512347    man
1         c_2   38    man      35.325076      139.410551    man
2         c_3   49  woman      35.120543      136.511179  woman
3         c_4   43    man      43.034868      141.240314    man
4         c_5   31    man      35.102661      136.523797    man

インデックスデータとマスタデータが格納されている。

In [8]:
customer_tb['sex_c'].cat.codes[:5]

0    0
1    0
2    1
3    0
4    0
dtype: int8

In [9]:
customer_tb['sex_c'].cat.categories

Index(['man', 'woman'], dtype='object')